{
  "backend/main.mo": "Backend canister handling authorization, user profiles, and storing volunteer, contact, and donation submissions with admin-protected query endpoints.",
  "feature_evidence.json": "Feature evidence report linking a text update task to affected frontend files and components with high confidence.",
  "frontend-file-summaries.txt": "Reference file listing short summaries for all main frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens with global styling rules.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root container, and loading the main React script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all site routes wrapped in a shared header–footer layout.",
  "frontend/src/components/FormStatusBanner.tsx": "Reusable alert component showing success or error messages with icons.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying branding, navigation links, contact details, and social icons.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop navigation, and mobile slide-out menu.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing the authenticated or anonymous backend actor with identity-based reinitialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useNgoSubmissions.ts": "Defines React Query mutation hooks to submit volunteer interests, contact messages, and donation pledges through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles and custom themed CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission, vision, values, and team member information using styled UI components.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and submission via React Query, plus contact info cards.",
  "frontend/src/pages/DonatePage.tsx": "Provides a donation pledge form with validation and impact examples, submitting pledges through React Query.",
  "frontend/src/pages/GetInvolvedPage.tsx": "Volunteer signup page with validation, form submission, and a list of volunteer opportunity categories.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero content, impact metrics, featured programs, and latest updates sections.",
  "frontend/src/pages/ProgramsImpactPage.tsx": "Displays multiple NGO programs with status, descriptions, impact stats, and locations.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, container settings, and plugins.",
  "project_state.json": "Project metadata describing site requirements, architecture notes, known issues, and implemented features."
}