{
  "backend/main.mo": "Motoko backend actor handling user profiles with authorization plus public submission and admin query endpoints for volunteer interests, contact messages, and donation pledges.",
  "feature_evidence.json": "Feature report describing required update for Economic Empowerment program locations and listing affected frontend file and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including pages, components, hooks, styles, and configuration.",
  "frontend/index.css": "Tailwind CSS base setup defining OKLCH color variables for light/dark themes and applying shared global styles.",
  "frontend/index.html": "HTML entry template setting favicon, metadata, and mounting root element for the React app.",
  "frontend/src/App.tsx": "Top-level React router configuration defining layout with header/footer and all site routes.",
  "frontend/src/components/FormStatusBanner.tsx": "Reusable alert banner component showing success or error states for form submissions.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with organization info, quick links, contact details, and social media icons.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation links, and mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "React hook creating authenticated or anonymous backend actor and managing refetching when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and login state using Dfinity AuthClient.",
  "frontend/src/hooks/useNgoSubmissions.ts": "Defines React Query mutations for submitting volunteer interest, contact messages, and donation pledges via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS with custom NGO-themed color variables and global styles for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the NGO’s About page with mission, values, and team member information.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and submission along with contact info cards.",
  "frontend/src/pages/DonatePage.tsx": "Provides a donation pledge form with validation and showcases example impact amounts.",
  "frontend/src/pages/GetInvolvedPage.tsx": "Volunteer sign‑up page with form validation, submission handling, and a list of volunteer opportunity categories.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring hero section, impact metrics, featured programs, and recent updates with navigation actions.",
  "frontend/src/pages/ProgramsImpactPage.tsx": "Displays major NGO programs with icons, descriptions, status, impact details, and locations.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Represents project metadata, requirements, architectural notes, and known issues for the NGO website build."
}