{
  "backend/main.mo": "Motoko actor managing volunteer interests, contact messages, donation pledges, and user profiles with authorization checks and admin‑only data queries.",
  "feature_evidence.json": "Feature evidence report listing updated address‑related frontend changes, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like mapping describing each frontend file’s purpose, routing setup, components, pages, constants, and styles.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing OKLCH color tokens and dark mode overrides.",
  "frontend/index.html": "HTML entry point setting page metadata, favicon, root mount point, and main script loader.",
  "frontend/src/App.tsx": "App router configuration defining layout and routes for all main pages using TanStack Router.",
  "frontend/src/components/FormStatusBanner.tsx": "Alert-based status banner component showing success or error messages for form submissions.",
  "frontend/src/components/SiteFooter.tsx": "Footer containing branding, navigation links, contact info using OFFICE_ADDRESS, and social media links.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, navigation links, and mobile menu using a sheet component.",
  "frontend/src/constants/ngoContact.ts": "Exports the shared OFFICE_ADDRESS constant used across the site.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useNgoSubmissions.ts": "Defines React Query mutations for submitting volunteer interests, contact messages, and donation pledges via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom color variables for light and dark themes, plus global typography and accessibility rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Displays mission, vision, values, and team members of the NGO using styled UI components.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation and backend submission, plus contact info cards.",
  "frontend/src/pages/DonatePage.tsx": "Provides a donation pledge form with validation and backend submission along with impact examples.",
  "frontend/src/pages/GetInvolvedPage.tsx": "Volunteer signup page with a validated form, submission mutation, and a list of volunteer opportunity cards.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, impact metrics, featured programs, and recent updates using static data.",
  "frontend/src/pages/ProgramsImpactPage.tsx": "Programs and impact overview page rendering multiple program cards with descriptions, metrics, and locations.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project state file describing NGO site requirements, content rules, known issues, and implemented features."
}