{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Correct and unify Samarpan Trust office address across volunteer page and site",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Update /get-involved “Our Address” block to display the same office address used on Contact page and footer.",
      "acceptanceCriteria": [
        "On /get-involved, the \"Our Address\" section no longer shows the old Bihar address lines and instead shows the address text: \"Chhaperwa, Sandh, Barkagaon, Hazaribagh, Jharkhand 825311\".",
        "The updated address is visible in the UI without requiring authentication and matches the address shown on the Contact page and in the footer."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/ngoContact.ts",
          "operation": "create",
          "description": "Create a single exported office-address constant set to: \"Chhaperwa, Sandh, Barkagaon, Hazaribagh, Jharkhand 825311\", so the address can be reused consistently across pages."
        },
        {
          "path": "frontend/src/pages/GetInvolvedPage.tsx",
          "operation": "modify",
          "description": "Replace the current “Our Address” block content (the Bihar address lines) with the exact office address text: \"Chhaperwa, Sandh, Barkagaon, Hazaribagh, Jharkhand 825311\", preferably by importing and rendering the shared constant from frontend/src/constants/ngoContact.ts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Ensure the Contact page address card uses the same shared office-address constant from frontend/src/constants/ngoContact.ts (no content changes beyond wiring to the constant). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Ensure the footer address line uses the same shared office-address constant from frontend/src/constants/ngoContact.ts (no content changes beyond wiring to the constant). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Remove/replace any remaining user-visible occurrences of the old Bihar address strings so they are not displayed anywhere on the site.",
      "acceptanceCriteria": [
        "A site-wide search for the old address strings returns no user-visible occurrences in the built UI.",
        "The only user-visible office address displayed across the site is consistent with: \"Chhaperwa, Sandh, Barkagaon, Hazaribagh, Jharkhand 825311\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GetInvolvedPage.tsx",
          "operation": "modify",
          "description": "Confirm the old address strings (\"Vill-Bhagatpur, P.O-Bhagatpur\", \"P.S-Bhagatpur, Dist-Samastipur\", \"Bihar, India - 848503\") are fully removed from the file and not rendered anywhere in /get-involved after the update. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/constants/ngoContact.ts",
          "operation": "modify",
          "description": "Centralize any future address rendering to the shared office-address constant to prevent reintroduction of old address strings; verify no old address strings exist in this file."
        }
      ]
    }
  ]
}